{
  "slides": [
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 1,
      "video_script": "哈喽，同学们！欢迎来到超有趣的 AI 通识课堂！今天我们要解锁一个超实用的 AI 技能 —— 设计算法！听到 \"算法\" 是不是觉得有点难？别担心，其实算法就藏在我们的生活里：指挥机器人走路需要算法，甚至我们每天早上从起床到上学，背后也藏着算法呢！这节课我们会先当 \"机器人指挥官\"，看看为啥机器人听不懂 \"随便走\"；再变身 \"寻宝设计师\"，给自己写一张 \"早晨上学的寻宝图\"。相信上完课，你们都会说：\"原来算法这么简单！\" 现在，就让我们一起开启今天的 \"算法探险\" 吧！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 2,
      "video_script": "上课前，老师先问大家一个小问题：如果你们对机器人说 \"往前走\"\"向左拐\"，它能像同学一样准确行动吗？有的同学可能会说 \"当然能！\"，但实际情况可能会让你大吃一惊哦！\n比如你跟同桌说 \"往前走一点\"，同桌会看看前面有没有桌子，走两步就停下；但如果对机器人说 \"往前走一点\"，它可能会一直走，直到撞到桌子才停下 —— 因为它不知道 \"一点\" 是多远，也不会避开障碍物。\n这节课我们就通过两个有趣的任务，找到答案：第一，指挥一个 \"蒙眼机器人\" 穿过教室迷宫；第二，给自己写一张 \"上学寻宝图\"。通过这两个任务，你们会发现：算法的核心其实是 \"精确\"，就像医生开药要写 \"每次 2 片\"，而不是 \"随便吃几片\" 一样。想知道怎么给机器人下正确指令吗？我们马上开始！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 3,
      "video_script": "好了，现在我们正式进入今天的课程 ——设计一个算法！这节课我们有三个小目标，大家可以记在心里：\n第一个目标，通过指挥 \"蒙眼机器人\"，搞明白为啥机器人不能听模糊指令，必须要 \"精确到数字\"；第二个目标，我们要把 \"早上上学\" 这件事拆成一步步的小任务，像写寻宝图一样，编出属于自己的 \"上学算法\"；第三个目标，找到生活里其他的算法，比如整理书包、拼乐高，发现 \"原来算法无处不在\"。\n这节课不会有复杂的公式，全是有趣的情景模拟和动手练习，大家只要跟着老师一起想、一起做，就能轻松掌握算法的秘密！现在，我们先进入第一个任务 —— 指挥机器人穿过 \"教室迷宫\"！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 4,
      "video_script": "首先，我们来搭建一个 \"教室迷宫\"！大家闭上眼睛想象一下：我们的教室长 9 米、宽 6 米，前面有个木质讲台，上面放着粉笔盒和绿萝；教室里有 4 排蓝色桌子、灰色椅子，第一排离门口 1.5 米，第二和第三排之间的过道最窄，只有 0.8 米；第四排墙角还掉了个黄色铅笔盒，旁边放着红色书包 —— 这些都是机器人要避开的障碍哦！\n今天的主角是机器人 \"小圆圆\"，它长得像个蓝色的小圆球，直径 30 厘米，头顶两根银色天线，肚子上的扬声器用来听指令，底部的小轮子用来走路。但可惜的是，它的 \"眼睛\"（摄像头）被黑布蒙住了，什么也看不见，只能靠我们的指令行动。\n更特别的是，小圆圆是个 \"一根筋\" 的机器人：它不知道教室有多大，不知道桌子有多宽，听到 \"往前走\" 就一直走，听到 \"转弯\" 就原地转，但不知道转多少度才对 —— 完全没有人类的常识！我们的任务就是：喊指令让小圆圆从前门走到讲台前，不能碰桌椅、不能撞墙、不能碰倒绿萝。\n现在小圆圆已经站在门口准备就绪了。大家可以发动脑筋想一想：你会给它下第一个什么指令？猜猜它会有什么反应呢？。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 5,
      "video_script": "很多同学可能会想：\"指挥机器人还不简单？先说‘往前走’呗！\" 那我们就试试这个指令，看看小圆圆会遇到什么麻烦！\n当我们喊 \"小圆圆，往前走！\"，小圆圆立刻开始走，但问题来了：\"往前走\" 没说 \"走多远\"，它的 \"一步\" 该多大呢？\n如果小圆圆的一步是 50 厘米（比你们的步子还大），它只走 1 步，就 \"咚\" 一声撞在第一排桌子腿上，桌上的橡皮、铅笔全掉了；如果一步是 10 厘米（像小婴儿走路），它走 10 步还在门口附近，根本没进过道；更搞笑的是，如果步子忽大忽小，它会像喝醉了酒一样歪歪扭扭，一会儿靠近桌子，一会儿远离桌子，永远找不到正确路线。\n这就像妈妈让你 \"去买瓶牛奶\"，却没说 \"买多大瓶\"，你可能买 100 毫升的小瓶，也可能买 2 升的大瓶 —— 机器人和我们一样，需要明确的 \"标准\"！\"往前走\" 没有距离标准，机器人自然不知道该停在哪，撞桌子也就不奇怪啦！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 6,
      "video_script": "看到小圆圆在门口卡壳，我们着急了，赶紧喊：\"小圆圆，停下来！向左拐！\" 可新的问题又出现了 ——\"向左拐\" 没说 \"转多少度\"，小圆圆根本不知道该转多大的弯！\n如果它只转 30 度，方向还是偏右，再往前走就会撞翻第一和第二排之间的椅子；如果转 90 度，方向倒是对准了过道，但因为之前没走到位，正对的是桌子侧面，往前走还是撞；如果转得太猛，转了 180 度，直接背对讲台，再走就离终点越来越远，甚至可能撞后门的扫帚柜；最哭笑不得的是，它可能把 \"向左拐\" 听成 \"向右转\"，\"砰\" 一声撞在门口墙上，蒙眼布都掉了！\n大家想想，如果你蒙着眼睛，同学只说 \"向左拐\"，你知道转多少吗？可能转一点，也可能转很多 —— 机器人和蒙眼的你一样，没有 \"角度标准\"，根本不知道 \"转多少才对\"，自然会走错方向啦！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 7,
      "video_script": "眼看小圆圆要么撞桌子、要么走错方向，我们更着急了，大声喊：\"小圆圆，往讲台那边走！\" 可小圆圆却一动不动，扬声器里传来 \"指令不明确，请重新下达\" 的声音 —— 它彻底懵圈了！\n为什么会这样呢？因为 \"讲台那边\" 是个超级模糊的词！小圆圆根本不知道 \"讲台\" 是什么东西，更不知道 \"那边\" 具体是左边、右边还是正前方；它甚至会随便选一个方向走，结果可能撞翻第二排桌子上的水杯，把水洒在课本上，或者踩到地上的铅笔盒，把铅笔都压断。\n现在我们来想一想：如果一位同学被蒙住眼睛，另一位同学说 \"往黑板那边走\"，其他同学来观察。大家会发现，蒙眼的同学会犹豫：\"黑板在哪边呀？\"\"走几步呀？\"—— 这和小圆圆的反应一模一样！人类蒙眼时都需要明确指令，更何况没有常识的机器人呢？。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 8,
      "video_script": "现在我们终于找到错误指令的 \"病根\" 了 —— 没有 \"量化标准\"！\"量化\" 就是用数字和单位把指令说清楚，比如 \"走 5 步\"\"转 90 度\"，而不是 \"走一点\"\"转一下\"。\n大家看 PPT 上的表格：\"往前走\" 缺了 \"距离标准\"，机器人不知道走多远；\"向左拐\" 缺了 \"角度标准\"，机器人不知道转多少度；\"往讲台那边走\" 缺了 \"方向标准\"，机器人不知道往哪走。这就像妈妈让你 \"去超市买文具\"，你会问 \"买什么文具？买多少？\"—— 因为没有标准，你不知道该怎么做。\n机器人比我们更 \"较真\"，它没有人类的 \"模糊判断能力\"，只能按 \"数字 + 单位\" 的指令行动。就像医生开药会写 \"每次 2 片，每天 3 次\"，而不是 \"随便吃几片\"；工程师给机器人写指令，也必须用精确的量化标准，不然机器人就会像小圆圆一样，要么撞东西，要么走错路。那正确的指令该怎么下呢？我们接着看！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 9,
      "video_script": "要给小圆圆下正确指令，第一步得先定 \"基础参数\"—— 就像我们知道自己一步有多大、一分钟能走多远一样，知道了小圆圆的参数，指令才能统一标准！\n工程师已经帮我们调试好小圆圆的参数了：它的一步是 30 厘米，和你们的步子差不多；转弯用 \"度\" 做单位，转够指定度数就会停下；走路速度是每秒 1 步，不快不慢，方便我们观察。\n同时，我们还要测量教室的关键数据：从门口到第一排过道入口是 1.5 米，1.5 米等于多少步呢？因为 1 步 30 厘米，1.5 米 ÷0.3 米 / 步 = 5 步，所以是 5 步；从过道入口到讲台前是 6.9 米，算下来就是 23 步；而且要在第二和第三排过道中间，左转 90 度才能对准讲台。\n有了这些 \"统一标准\"，我们的指令就像有了 \"共同语言\"，小圆圆能准确理解每一个指令的意思，不会再懵圈啦！接下来，我们就可以编写完整的指令序列了！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 10,
      "video_script": "有了基础参数和教室数据，我们就能像写 \"寻宝路线图\" 一样，给小圆圆编 \"指令序列\" 啦！大家拿出草稿纸，跟着老师一起记：\n第一步，指令 1：\"小圆圆，向前走 5 步！\"—— 小圆圆每秒走 1 步，走 5 步就是 1.5 米，刚好从门口走到过道入口，身体正对过道，不会撞桌椅；\n第二步，指令 2：\"小圆圆，向左转 90 度！\"—— 它会原地慢慢转，转够 90 度就停，方向从 \"对教室后方\" 变成 \"对讲台方向\"，现在正前方就是目标啦；\n第三步，指令 3：\"小圆圆，向前走 23 步！\"——23 步是 6.9 米，它会沿着第二和第三排之间的过道走（过道宽 0.8 米，它直径 30 厘米，走中间很安全），刚好到讲台前 1 米处；\n第四步，指令 4：\"小圆圆，向前走 3 步！\"——3 步是 0.9 米，最后稳稳停在讲台正前方 10 厘米处，不会碰倒绿萝，扬声器还会传来 \"任务完成\" 的声音！\n大家发现没？这组指令每一步都有明确的 \"距离\" 或 \"角度\"，还有固定的顺序，就像寻宝图上 \"1. 到大树下→2. 左转→3. 走 10 步\" 一样，小圆圆跟着做，就能顺利完成任务！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 11,
      "video_script": "在现实生活中，工程师给机器人写的指令会更专业，但核心和我们给小圆圆的指令一样，都是 \"数字 + 单位\" 的精确表达！\n比如汽车厂里的工业机械臂，它组装零件时的指令会精确到 \"毫米\" 和 \"秒\"，比如 \"向前移动 150 毫米，旋转 15 度，停留 2 秒\"—— 因为零件组装差 1 毫米都不行，必须绝对精确；\n家里的扫地机器人，指令会用 \"米\" 和 \"度\"，比如 \"向前移动 2 米，向右转 45 度，开始清扫\"—— 这样它能按路线打扫，不会重复扫或漏扫；\n商场里的引导机器人，还会用 \"坐标\" 定位，比如 \"从（10,20）坐标移动到（30,40）坐标，方向 180 度\"—— 就像地图上的定位点，能准确找到位置。\n这些指令虽然看起来复杂，但和我们说 \"向前走 5 步（30 厘米 / 步）\" 的逻辑完全一样：用明确的数字和单位，让机器人有章可循，不会出错。！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 12,
      "video_script": "通过指挥小圆圆的游戏，我们终于明白：机器人和计算机都是 \"一根筋\" 的执行者！它们没有人类的模糊判断能力，只能严格按算法（指令序列）行动，这是为什么呢？\n首先，它们没有 \"常识\"：人类看到墙会主动绕开，因为知道 \"撞墙会疼\"；但机器人不知道 \"墙是硬的\"，如果指令没说 \"避开墙\"，它会一直走，直到撞坏自己。\n其次，它们没有 \"模糊判断\"：人类听 \"往前走一点\"，会根据距离走 2-3 步；但机器人听 \"往前走\"，会按固定步长一直走，不管前面有没有桌子。\n最后，它们不会 \"灵活调整\"：人类过马路看到绿灯，会左右看有没有车；但机器人如果只收到 \"绿灯过马路\" 的指令，会直接冲过去，哪怕有汽车驶来也不避让。\n正因为如此，我们给机器人设计的算法必须绝对精确 —— 每一步的距离、角度、顺序都要写清楚，不能有任何模糊空间。就像指挥小圆圆要写 \"向前走 5 步\"，而不是 \"往前走一点\"；工厂机械臂的指令要写 \"移 150 毫米\"，而不是 \"移一点\"。这就是算法的核心要求！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 13,
      "video_script": "同学们，刚才我们学会了给机器人写精确算法，其实在生活中，很多事情也能写成算法！比如我们每天早上从起床到上学，背后就藏着一套 \"上学算法\"。今天我们就把这件事变成 \"寻宝游戏\"，超有趣！\n大家都玩过寻宝吧？寻宝需要起点、宝藏、避开障碍，还要一张寻宝图。我们的 \"上学寻宝\" 也是这样：\n寻宝起点是你的小床，就像游戏里的 \"营地\"；\n终极宝藏是学校教室，就像游戏里的 \"终极奖品\"；\n寻宝障碍有很多，比如 \"再睡 5 分钟\" 的赖床、忘带作业本、赶不上校车，这些会让 \"寻宝失败\"；\n而我们要写的 \"上学算法\"，就是一张详细的 \"寻宝图\"，能帮我们避开障碍，顺利找到 \"学校宝藏\"。\n很多同学偶尔会 \"寻宝失败\"：比如赖床 20 分钟，导致洗漱匆匆忙忙；或者忘带红领巾，到学校才发现。其实这些问题都是因为没有 \"清晰的寻宝图\"！如果我们像给机器人写算法一样，把早上的每一步都写清楚 \"做什么、什么时候做\"，就能每天轻松 \"找到宝藏\"。接下来，我们就一起写这张 \"上学寻宝图\" 吧！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 14,
      "video_script": "\"上学寻宝\" 的第一步是 \"唤醒准备\"，就像寻宝游戏从营地醒来一样。我们的目标是：7:00 起床，7:20 前完成所有准备，不能拖延！\n首先要在前一晚做好准备：把闹钟设到早上 7:00，选一首你喜欢的铃声，比如《小星星》，这样醒来时心情好；然后把闹钟放在书桌或床头柜对面，不要放枕头边 —— 因为放枕头边你会伸手就按 \"稍后提醒\"，这是 \"寻宝第一大陷阱\"！\n当闹钟 \"叮铃铃\" 响时，必须做两件事：第一，立刻关闭闹钟，手机闹钟要解锁后点 \"关闭\"，床头闹钟按 \"停止键\"，绝对不能按 \"稍后提醒\"！第二，马上起床：坐起身伸个懒腰，然后掀开被子下床，不要躺回床上 —— 因为躺着躺着，大脑会以为还在睡觉，很快又会迷糊过去，就像寻宝时听到出发信号却不动，会落后一样！\n大家有没有按 \"稍后提醒\" 睡过头的经历呀？如果有的话，下次试试把闹钟放远一点，保证你会立刻起床！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 15,
      "video_script": "起床后，下一步要快速从 \"卧室营地\" 走到 \"卫生间准备区\"，这是 \"过渡准备环节\"，帮助我们从 \"睡眠模式\" 切换到 \"清醒模式\"。\n首先要穿拖鞋：弯腰拿起放在床边的拖鞋，分清左右脚 —— 可以看拖鞋上的图案，比如左边是小熊头，右边是小熊尾巴，把脚完全放进拖鞋里，不要只穿一半，不然走路时拖鞋会掉。千万不要光脚走，地板可能冰凉，容易着凉，还可能踩到地上的铅笔、橡皮，这是 \"寻宝小陷阱\"！\n穿好拖鞋后，一定要直接走向卫生间，不要在卧室里逗留！比如不要去玩床头的玩具、翻漫画书，也不要坐在床上发呆 —— 这些都会浪费时间，可能导致后面的步骤赶不上。就像寻宝时从营地到装备库，要快速走，不能停下来玩，不然会落后其他同学！\n这一步虽然简单，但能帮我们快速清醒，为接下来的洗漱做好准备！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 16,
      "video_script": "到达卫生间后，就进入 \"核心准备环节\"—— 洗漱！这一步要按 \"先刷牙、后洗脸\" 的顺序来，总共 3 分钟，不能敷衍哦！\n先看刷牙，要做 4 件事：第一，拿出牙刷，挤黄豆大小的牙膏（不要挤太多，不然泡沫会呛到），再把牙刷淋湿；第二，按牙医教的方法刷 —— 上牙从牙龈往下刷，下牙从牙龈往上刷，牙齿内侧也要刷，不然会长牙菌斑；第三，一定要刷满 2 分钟，可以在心里默数 \"1、2……120\"，因为刷够时间才能把细菌清干净；第四，刷完后漱口 3-5 次，把牙膏沫吐干净，再把牙刷冲好放进杯子里。\n然后是洗脸，只要 1 分钟：第一，拿自己的毛巾，用温水打湿（不要太烫或太凉），拧到不滴水；第二，先擦额头，再擦脸颊，然后擦鼻子和下巴；第三，洗完后用毛巾擦干脸，把毛巾挂回毛巾架，最后冲干净洗手台的牙膏沫。\n洗脸能让我们的头脑更清醒，就像给机器人的 \"传感器\" 做清洁 —— 机器人摄像头脏了看不清路，我们脸洗干净了，眼睛会更亮，精神也更足！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 17,
      "video_script": "洗漱完后，我们要回到 \"卧室装备库\"，穿上 \"寻宝专用装备\"—— 校服，再用 5 分钟整理仪表，让自己看起来干净整齐！\n穿校服有小技巧：第一，前一晚就把校服叠好放在衣柜最上层，早上不用翻来找去；第二，要按 \"内衣→衬衫→外套→裤子 / 裙子\" 的顺序穿，比如穿衬衫时从下往上扣扣子，避免扣错；第三，穿好后一定要对着镜子看一眼，确认外套、裤子没有穿反 —— 比如外套的图案在正面，裤子的口袋在前面，不然到学校会闹笑话！\n整理仪表也很重要：长头发的同学要把头发扎成马尾或辫子，别让头发挡住眼睛；短头发的同学用梳子梳整齐。如果学校要求戴红领巾或校徽，要正确佩戴 —— 红领巾按 \"左尖压右尖，右尖绕一圈，从圈里抽出尖\" 的步骤系，校徽别在校服左胸口，不要别歪或别在袖子上。\n最后再对着镜子看一眼，确保校服没有褶皱，红领巾系得正，这样你就会以最精神的样子开始 \"寻宝之旅\" 啦！到这里，\"唤醒准备\" 阶段就完成了，接下来我们要 \"补充能量\"，为走路去学校储备体力！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 18,
      "video_script": "\"上学寻宝\" 的第二步是 \"补充能量\"，就像寻宝游戏到 \"补给站\" 吃食物一样。我们的目标是 7:20 到 7:30，用 10 分钟吃完早餐，不能磨蹭！\n首先，从卧室出来后要直接走到餐厅，不要在客厅停留 —— 比如不要停下来看电视、玩玩具，也不要和家人聊太久，这些都会浪费时间，可能导致赶不上校车。\n走到餐厅后，找到自己固定的座位轻轻坐下，坐姿要端正：后背挺直，双脚平放在地面上，不要跷二郎腿，也不要趴在餐桌上 —— 端正的坐姿能让你的肠胃更舒服，吃饭更香！\n坐下后，看看餐桌上的早餐，比如包子、鸡蛋、粥、牛奶，心里快速规划用餐顺序 —— 建议先吃主食（包子、面包），再喝饮品（牛奶、粥），这样肠胃消化更顺畅。如果早餐需要自己盛，比如盛粥或牛奶，要注意不要盛太满，避免端的时候洒出来，弄脏衣服。\n这一步就像寻宝到了补给站，要快速做好准备，马上开始 \"补充能量\"！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 19,
      "video_script": "现在正式开始 \"补充能量\"—— 吃早餐！这一步有三个关键要求，大家要记住：\n第一，要细嚼慢咽：拿起筷子或勺子，小口吃饭，每口食物咀嚼 10-15 次再咽下去。比如吃包子时，先咬一小口，慢慢嚼出肉馅的香味；吃鸡蛋时，先剥壳分成小块，一块一块吃。不要狼吞虎咽，不然容易噎到，也不利于消化。\n第二，要不挑食、不浪费：早餐里的每种食物都要吃 —— 主食（包子、面包）能给你提供主要能量，让你上午不饿；鸡蛋能提供蛋白质，让你的大脑更灵活，上课更专心；蔬菜能提供维生素，让你少生病。要把盘子里的食物全部吃完，不要只吃包子馅不吃皮，也不要只吃蛋黄不吃蛋白，浪费食物很可惜，还会让你能量不够！\n第三，要专注用餐：吃饭时不要东张西望，不要和家人聊太久的天，也不要边吃边看手机或平板。这些行为会分散你的注意力，让吃饭时间变长，比如本来 10 分钟能吃完，结果吃了 20 分钟，就会赶不上校车。你可以在心里默数 \"还有 5 分钟就要吃完了\"，提醒自己加快速度。\n这一步的 \"结束标准\" 很明确：盘子里的食物完全为空，没有剩余！就像机器人执行任务要 \"做完才算完\"，我们也要把早餐吃完，才算 \"能量补给到位\"！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 20,
      "video_script": "吃完主食后，我们还要补充水分和营养，执行 \"喝牛奶\" 或 \"喝粥\" 的指令 —— 可以根据家里的早餐搭配调整，今天喝牛奶，明天喝粥都可以。\n喝的时候要注意三点：第一，要慢慢喝：拿起杯子，小口慢饮，不要一口喝完。尤其是刚热过的牛奶或粥，温度比较高，要先吹一吹再喝，避免烫伤嘴巴；第二，要喝干净：把杯子里的牛奶或粥全部喝完，不要剩下半杯。牛奶里的钙质能让你的骨骼更强壮，长大长得高；粥里的水分能补充你身体所需，避免上午在学校口渴；第三，要做好收尾：喝完后，把杯子拿到厨房水槽边，简单冲洗一下（如果家里有洗碗机，就放进洗碗机里），不要随便放在餐桌上，这样能保持家里的整洁。\n这一步就像寻宝游戏里 \"补充水分\"—— 喝完牛奶或粥后，你的身体会更有活力，就像给机器人加了 \"高级燃料\"，能更有力地完成接下来的 \"寻宝路程\"！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 21,
      "video_script": "吃完早餐后，最后一步是 \"清洁收尾\"—— 擦嘴和整理餐桌，这一步能体现你的好习惯哦！\n首先是擦嘴：从餐桌上拿起一张干净的餐巾纸，不要用用过的纸巾，也不要用袖子擦嘴，这样不卫生。擦的时候，先擦嘴角的食物残渣，比如包子馅的油、牛奶的奶渍，再擦嘴唇，最后擦一下手 —— 吃饭时手上可能沾到食物，擦干净才不会弄脏校服和书包。\n然后是整理餐桌：擦完嘴后，把用过的餐巾纸扔进垃圾桶，不要扔在餐桌上或地上；如果餐桌上有食物碎屑，比如面包渣、包子皮，用手轻轻扫到垃圾桶里。这样能保持餐桌整洁，妈妈收拾起来也更轻松。\n这一步虽然简单，但很重要 —— 就像机器人完成任务后要 \"清洁自身\" 一样，我们也要保持个人卫生和环境整洁，以清爽的形象开始接下来的 \"寻宝之旅\"！到这里，\"补充能量\" 阶段就完成了，你的身体已经充满 \"燃料\"，准备好出发去寻找 \"学校宝藏\" 啦！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 22,
      "video_script": "经过 \"营地启动\" 和 \"物资补给\"，终于到了 \"寻宝终极冲刺阶段\"—— 出发去学校！第一步是背上你的 \"寻宝装备包\"—— 书包，里面装着 \"寻宝所需物资\"（课本、作业等），所以一定要仔细检查，不能漏带！\n检查时可以按这个清单来：第一，课本有没有带齐？语文、数学、英语课本要按科目顺序放进书包，不要乱堆；第二，昨天的作业有没有放进书包？尤其是需要交的作业，要放在书包外侧口袋，早上到学校能快速交；第三，文具盒里的文具够不够？铅笔要削好，橡皮、尺子要在，不要到了学校才发现没带笔；第四，其他物品有没有带？水杯要装满水、拧紧盖子，避免漏水弄湿课本；红领巾或校徽也要确认在身上。\n这里有个小窍门：前一晚就把书包整理好，早上只需要简单确认一遍，这样能节省时间，避免早上慌慌张张找东西。就像寻宝游戏前要检查装备一样，书包里的 \"物资\" 齐全，你的 \"寻宝之旅\" 才能更顺利！\n检查完后，要正确背书包：把两条背带都拉到合适的长度，让书包紧贴后背，不要只背一条背带 —— 单肩背书包会让肩膀受力不均，长期下来容易驼背哦！。"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 23,
      "video_script": "背上书包后，下一步是 \"穿上鞋子\"，准备出门！这一步要注意两个关键：\n第一，选对鞋子：根据天气和学校要求选 —— 如果是晴天，穿运动鞋或皮鞋；如果是下雨天，穿雨鞋，或者带好雨靴到学校换；如果是冬天，穿保暖的棉鞋。不要穿拖鞋或凉鞋，不符合学校要求，也容易在走路时受伤。\n第二，穿好鞋子：把脚伸进鞋子里，先分清左右脚 —— 可以看鞋子上的图案，比如左边是小熊，右边是小兔；然后系好鞋带或粘好魔术贴，鞋带要系紧，避免走路时松开绊倒自己；魔术贴要粘牢，不要只粘一半。\n穿好后，站起来走两步，确认鞋子合脚、舒适，没有穿反。比如感觉鞋子挤脚，可能是穿反了，要及时调整。\n穿好鞋子后，在门口站一会儿，做最后一次 \"装备检查\"：摸一摸红领巾或校徽还在不在，书包拉链有没有拉好，水杯有没有拧紧。确认没问题后，就可以准备开门出发了！！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 24,
      "video_script": "一切准备就绪，现在要执行 \"出门\" 指令啦！这一步要注意安全，不能慌慌张张：\n首先是开门：如果用钥匙开门，打开后要记得把钥匙拔下来，放进书包的钥匙扣里，不要忘在家里 —— 不然晚上放学回家就进不了门了；如果用门把手开门，直接拉开就行。打开门后，先左右看一眼门外的情况，比如有没有邻居经过，有没有陌生的人或车，确保安全后再出门。\n然后是出门：慢慢走出家门，不要跑 —— 门口空间小，跑容易撞到门框或路过的邻居，还可能摔倒。走出家门后，不要忘记 \"关上家门\"：轻轻把家门拉上，然后用手转动门把手，确认门已经锁好，这样能保护家里的安全，防止小偷进入。关门时不要太用力，避免发出太大的声音影响邻居。\n这一步就像寻宝游戏 \"离开营地前关好帐篷\"—— 关门不仅是安全要求，也是 \"寻宝之旅正式开始\" 的信号！走出家门后，你就踏上了 \"寻找学校宝藏\" 的最后一段路程！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 25,
      "video_script": "走出家门后，要沿着 \"固定的寻宝路线\" 去学校 —— 这条路线最好是和爸爸妈妈一起确定的 \"安全路线\"，比如 \"家→小区门口→过马路→公交站→学校\"，不要随便更改路线，避免迷路或遇到危险。\n走路时要遵守 \"寻宝安全规则\"：第一，走人行道，不要走在马路中间；如果没有人行道，要靠马路右侧行走，远离汽车；第二，过马路时一定要走斑马线，看红绿灯 —— 红灯停、绿灯行，就算是绿灯，也要左右看有没有闯红灯的汽车或电动车，确认安全后再走；第三，不要贪玩，走路时不要边看手机、边玩玩具，也不要和同学追逐打闹，这些行为会分散注意力，有安全隐患。\n同时要控制好时间：比如 7:30 从家出发，7:35 走到小区门口，7:40 走到公交站，7:45 坐上校车，7:50 就能到学校。可以看一下手表或电话手表，确认时间，不要走太慢，也不要走太快。\n当你看到学校大门，走进校园，走到教室门口，把书包放在座位上，拿出第一节课的课本时，恭喜你！\"早晨上学寻宝图\" 算法完美执行完毕，你成功 \"找到学校宝藏\" 啦！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 26,
      "video_script": "同学们，今天我们不仅指挥机器人学会了 \"精确行动\"，还把 \"早晨上学\" 写成了 \"寻宝图算法\"，是不是很有成就感呀？现在我们来总结一下这节课的重点：\n首先，我们发现上学算法有两个核心特点：一是 \"顺序性\"，比如要先刷牙再洗脸，先穿袜子再穿鞋，步骤不能颠倒；二是 \"确定性\"，比如 7:00 必须起床，早餐要吃空盘子，每一步都有明确的标准，不能模糊。\n其次，我们还发现生活中到处都是算法：整理书包有 \"课本→作业→文具→水杯\" 的步骤；拼乐高有 \"找零件→按步骤拼→检查\" 的算法；甚至煮方便面也有 \"加水→点火→放面→放调料\" 的顺序。这些都是算法！\n其实算法的本质很简单：就是把复杂的任务，拆成 \"一步一步、清晰明确\" 的精确步骤。就像指挥机器人要拆成 \"走 5 步→转 90 度→走 23 步\"，上学要拆成 \"起床→洗漱→吃早餐→出发\"。有了算法，再复杂的事情都会变得简单、有条理！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 27,
      "video_script": "同学们，这节课我们学会了设计算法，课后大家可以完成一个小任务 —— 编写 \"我的专属算法\"，超有趣！\n任务很简单：首先，选一件你喜欢的事，比如拼乐高、煮方便面、整理自己的房间，或者做手工；然后，把这件事拆成一步步的步骤，按 \"第一步、第二步、第三步\" 写下来，步骤要有顺序，不能乱；最后，给每一步标上 \"明确标准\"，比如 \"拼乐高第一步：找齐说明书第 1 页的零件，用 5 分钟\"\"煮方便面第二步：放 2 勺调料，搅拌均匀\"。\n比如老师给大家举个例子：\"拼乐高算法\" 可以这样写：第一步，拿出乐高盒子和说明书，放在桌子上（1 分钟）；第二步，找齐说明书第 1 页的所有零件，放在手边（5 分钟）；第三步，按说明书第 1 页的图示，把零件拼在一起（10 分钟）；第四步，检查有没有拼错，有错就修改（2 分钟）…… 这样一步步写，就是完整的算法啦！\n下次做这件事时，跟着自己写的算法走，看看是不是会更顺利、更高效！下节课我们可以分享自己的算法，看看谁的算法最清晰、最实用！"
    },
    {
      "chapter": 2,
      "section": 4,
      "main_title": "设计一个算法",
      "slide_number": 28,
      "video_script": "同学们，今天的 AI 通识课到这里就结束啦！我们一起回顾一下这节课的重点：\n首先，我们知道了机器人是 \"一根筋\" 的执行者，需要 \"数字 + 单位\" 的精确指令，所以算法必须绝对精确，不能有模糊空间；其次，我们把 \"早晨上学\" 变成了寻宝游戏，算法就是寻宝图 —— 有明确的起点、步骤和标准，能帮我们避开赖床、忘带东西的障碍；最后，我们发现生活中到处都是算法，只要把事情拆成一步步的步骤，就能设计出自己的算法。\n课后大家一定要记得完成 \"我的专属算法\" 小任务哦！希望大家都能爱上算法，用算法让生活变得更有条理！今天就到这里，下课啦！"
    }
  ]
}
