{
  "slides": [
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 1,
      "video_script": "同学们，你们有没有过这样的经历：脑海里有一幅特别美的画面——可能是\"下雨天里，小猫躲在便利店门口踩水洼\"，可能是\"会发光的鲸鱼背着小房子在云朵里飞\"，却因为不会拿画笔、不懂配色，只能眼睁睁看着这个画面慢慢\"消失\"？"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 2,
      "video_script": "现在，有了AI小画家，这个问题就迎刃而解啦！它就像一个\"全能画手\"，能根据我们的文字描述，画出各种各样的画。\n但要让AI画出我们\"心里那幅画\"，可不是随便说一句话就行的——关键在于学会和它\"精准沟通\"，而这种沟通的专属语言，就是\"提示词\"。接下来我们就按照以下思路，一步步掌握这门\"指令的艺术\"。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 3,
      "video_script": "当我们想让AI小画家创作时，不能只简单地说\"画一幅画\"，而需要详细地告诉它我们想要什么样的画。这种用来向AI描述画面的文字，就是\"提示词\"（Prompt）。它是我们和AI小画家之间的桥梁，直接决定了AI最终的创作效果。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 4,
      "video_script": "同学们，今天咱们要解锁AI绘画最核心的秘密武器——提示词（Prompt）！想象一下：你站在AI小画家面前，想让它画出脑海里的奇妙画面，但如果只说\"画一幅画\"，就像让厨师做\"随便炒个菜\"——结果可能是盘清炒青菜，而你其实馋的是番茄炒蛋配米饭！这就是提示词的意义：把脑海中模糊的想象，转化为AI能听懂的\"精准指令\"。\n先举个生活类比：让同桌帮你画一只小动物。如果只说\"画一只小动物\"，同桌可能画小猫、小狗，甚至突发奇想画只恐龙！但你真正想要的，是\"一只戴着棕色针织帽、围着红围巾的棕色小熊，坐在铺满枫叶的石头上，爪子里抱着蜂蜜罐，罐口还沾着一滴蜂蜜\"。问题出在哪？——你没把想法说清楚！和AI沟通也是同样逻辑：AI就像\"等待指令的同桌\"，但它比同桌更\"老实\"——只会严格按照文字指令创作，完全不会\"猜你的心思\"。\n再看AI绘画的对比实验：\n模糊指令：\"画一只猫\"→AI可能画出黑猫、白猫，站着的、躺着的，在房间里的、在草原上的……100个AI能画出100种猫，很难刚好是你想象的\"白色小猫在阳光下的草地上打滚，旁边有三朵黄色小花，尾巴尖沾着草屑，耳朵被阳光照得半透明\"。\n精准指令：把上述细节写成提示词→AI像拿到\"精确地图\"，一步一步还原你脑海的画面。\n为什么AI需要这么详细的提示？因为AI没有人类的\"常识\"。比如你说\"画一只可爱的猫\"，人类知道\"可爱\"大概是圆眼睛、短耳朵，但AI不懂——它可能画成瘦长脸的猫！只有把\"圆眼睛、粉鼻子、胖嘟嘟的身体\"写进提示词，AI才明白\"哦，原来可爱是这样的！\"。所以，提示词是你和AI之间的\"共同语言\"——把想象翻译成AI能理解的文字密码，才能让它成为你的专属画家。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 5,
      "video_script": "大家都听过阿拉丁神灯的故事吧？当阿拉丁对着神灯喊\"给我金子！\"，精灵可能扔来一堆散碎金币；但如果他说\"给我一箱用绣着金线的红布包裹的金币，每枚金币边缘刻着星纹，箱子上镶嵌蓝宝石\"——精灵就会完美实现这个精准愿望！提示词就像神灯的咒语，描述得越精准，AI这个\"精灵\"实现愿望的效果就越惊艳。\n把这个类比用到AI绘画里：\n笼统指令：\"画一棵大树\"→AI可能画最普通的绿色树干、椭圆形树叶（像精灵给的\"基础款金子\"）。\n精准指令：\"一棵枝叶繁茂的老橡树，树干布满深褐色裂纹，树叶在秋风中微微摆动，阳光透过叶缝洒下光斑，树下三只小松鼠抱着松果追逐，草地里藏着紫色的风铃草\"→AI画出的画面立刻有了故事感：老橡树的沧桑、秋风的动态、阳光的温暖、小松鼠的活泼，甚至连草里的小花都有了细节！\n再举个反例加深理解：假设你想画\"一个女孩在看书\"，如果只写这句话，AI可能画成现代女孩坐在沙发上，也可能画成古代书生！但如果加上细节：\"古风汉服女孩，扎着双丫髻，穿着粉白襦裙，坐在开满桃花的窗台下，手捧线装书，阳光从窗棂斜照在发梢，书页上落着一只蝴蝶\"——AI瞬间明白：哦，要画的是古代、汉服、桃花场景、静态看书但有蝴蝶点缀的画面！这种从\"模糊轮廓\"到\"清晰画面\"的转变，就是提示词的魔法：每多一个细节，就给AI的画笔多一份指引。\n现在大家可以畅想：如果让你对\"神灯AI\"许愿画一幅画，你会怎么设计咒语？是简单说\"画个公主\"，还是说\"迪士尼风格的公主，金色卷发扎成麻花辫，宝蓝色蓬蓬裙上有星光刺绣，站在飘着花瓣的水晶楼梯上，眼神温柔又坚定\"？试着把愿望拆成\"主体+细节+场景+风格\"，你会发现AI画出的世界，和你脑海里的幻想越来越像——这就是提示词的魅力：让AI成为帮你把幻想\"实体化\"的神灯精灵。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 6,
      "video_script": "一个好的提示词，可不是随便堆砌文字，而是像搭积木一样，把几个关键要素组合起来：主体、细节、场景、风格，再加上光线、动作等\"调味剂\"。掌握这些要素，你就能让AI画出\"独一无二\"的作品，而不是\"千篇一律的模板画\"。\n1.主体：画面的\"主角\"。主体是提示词的基础，就像作文里的\"中心人物\"。它可以是具体事物（如\"小猫\"\"城堡\"\"太空飞船\"），也可以是抽象概念（如\"希望\"\"时间\"）——但抽象主体更需要用细节具象化（比如\"时间\"可描述为\"青铜沙漏，沙粒泛着金辉，悬浮在星空背景中\"）。如果没写主体，AI就像\"没头苍蝇\"，根本不知道画什么。\n2.细节：让主角\"活起来\"的魔法。细节是给主体\"贴标签\"：颜色、形状、材质、装饰……比如主体是\"兔子\"，细节可以是\"雪白的绒毛（颜色）、耳朵尖有棕色斑点（形状）、脖子系着丝质领结（装饰）、爪子抱着玻璃球（动作道具）\"。细节越细，AI画出的主角越独特——同样是兔子，\"机械兔\"和\"毛绒兔\"的细节完全不同：机械兔：\"金属外壳、关节处有蓝光、眼睛是LED屏\"毛绒兔：\"蓬松毛、粉鼻子、软耳朵\"\n3.场景：主角的\"舞台\"。场景决定画面的氛围：是\"开满鲜花的草地\"（浪漫），还是\"废弃的机械工厂\"（科幻）？比如画\"公主\"：场景选\"水晶城堡阳台\"（梦幻）→画面温柔华丽；场景选\"火山口边缘\"（冒险）→画面紧张刺激。场景还能加入动态元素，比如\"樱花飘落的庭院\"（静态美）vs\"暴风雨中的海盗船甲板\"（紧张感）。\n4.风格：画面的\"滤镜\"。风格决定作品的艺术基调：卡通风格（可爱）、写实风格（逼真）、水彩风格（柔和）、油画风格（厚重）、赛博朋克（炫酷）……比如画\"城市\"：卡通风格→简化建筑线条，色调明亮；赛博朋克→强调霓虹、高楼和科技感。甚至可以混搭风格，比如\"水墨风格的赛博城市\"——古老水墨笔触+未来科技建筑，碰撞出独特火花！\n5.额外调味：光线、动作、氛围。除了四大要素，还能加\"光线\"（暖光、冷光、逆光）、\"动作\"（奔跑、微笑、沉思）、\"氛围\"（神秘、温馨、惊悚）。比如提示词：\"蒸汽朋克风格的猫头鹰，金属羽毛泛着铜色光泽（主体+细节），站在齿轮转动的钟楼顶端（场景），夕阳的橙光给翅膀镀上金边（光线），眼神锐利地俯视下方（动作）\"——这样的提示词，AI画出的画面会充满故事感！\n示例对比：错误vs正确。错误：\"画一只龙\"→AI可能画普通西方龙，没特色。正确：\"东方水墨风格的青龙，鳞片泛着青蓝色光泽，龙须随风飘动，盘旋在云雾缭绕的昆仑山顶，月光从龙身穿过，在云海投下银白影子\"→包含主体（青龙）、细节（青蓝鳞片、飘动龙须）、场景（昆仑山、云雾、月光）、风格（东方水墨），画面立刻鲜活！\n同学们，提示词就像\"文字版的分镜脚本\"，把每个要素组合好，就能指挥AI画出你心中的世界。接下来的课程里，咱们会挑战画\"会飞的魔法书本\"（主体：魔法书；细节：封面烫金、书页飘出星光；场景：悬浮在星空图书馆；风格：哥特风）、\"穿越时空的小学生\"（主体：背书包的男孩；细节：校服带时光机图案；场景：恐龙时代的草原；风格：卡通写实结合）……通过一次次练习，你会发现：只要掌握提示词的要素，AI就是你最听话的\"数字画笔\"，能把所有奇思妙想变成看得见的画面！"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 7,
      "video_script": "同学们，刚刚我们认识了提示词的基本概念和构成要素，知道了提示词是和AI小画家沟通的关键——就像我们和同桌分享想法时，说的话越清楚，同桌越能get到你的点。现在我们就通过具体案例来亲手\"解锁\"提示词的\"魔法\"：同样是画\"猫\"这个主题，不同的提示词会让AI画出怎样截然不同的作品？这些让画面\"变身\"的魔法背后，到底藏着什么秘密呢？大家可以先在心里猜一猜，我们马上揭晓答案！\n我们先从最简单的提示词开始实验，这也是很多同学第一次用AI画画时会尝试的输入方式——只输入\"一只猫\"。大家闭上眼睛想一想，如果你是AI，接到\"画一只猫\"的任务，会怎么画？现在我们来看AI的创作结果：屏幕上出现的猫，真的是\"五花八门\"——有橘色的胖猫蜷在沙发角落，爪子还抱着半颗毛线球；有黑色的瘦猫站在木质窗台上，尾巴微微翘起，仿佛在盯着窗外飞过的小鸟；有三花猫趴在笔记本电脑键盘上，一只爪子轻轻搭在\"Enter\"键上，像是在\"捣乱\"；还有纯白的布偶猫，耳朵尖带着淡淡的粉色，优雅地趴在地毯上舔爪子。这些猫的形象都很真实，比例、形态都符合我们对\"猫\"的认知，但仔细看就会发现，它们都很普通，没有让人眼前一亮的亮点，就像我们在路边、邻居家随处可见的猫一样。\n为什么会出现这样的结果呢？核心原因就在于\"一只猫\"这个提示词太\"笼统\"了——它只给了AI一个最核心的\"主体\"信息（猫），却没有任何关于\"细节\"（比如猫的颜色、品种、表情、动作）、\"场景\"（比如在室内还是室外、在做什么）或\"风格\"（比如可爱风、写实风）的描述。AI就像接到了一个模糊的\"任务清单\"，上面只写了\"做一道菜\"，却没说要做什么菜、什么口味、给什么人吃，所以它只能从自己学习过的\"猫\"的通用数据库里，随机挑选最常见的元素组合——比如\"家猫+常见动作+普通环境\"，最终生成的画面自然就缺乏个性和创意。这就像我们跟同桌说\"画一只猫\"，同桌既不知道你喜欢橘猫还是黑猫，也不知道你想让猫在睡觉还是玩耍，只能凭自己的常规认知画一只\"不会出错但也不特别\"的猫，很难刚好命中你心里那只\"独一无二的猫\"。所以说，简单的提示词能帮我们完成\"画猫\"的基本任务，但想让AI画出能让你眼前一亮的作品，还需要更多\"魔法素材\"。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 8,
      "video_script": "接下来，我们就给提示词\"加料\"——增加细节和场景描述，看看这能给画面带来什么翻天覆地的变化。这次我们输入的提示词是：\"一只穿着宇航服的可爱小猫，漂浮在太空中，背景是美丽的蓝色地球\"。大家看到这行字，是不是脑海里已经浮现出画面了？现在我们来看看AI的创作，是不是和你想象的一样惊艳！\nAI画出的小猫，完全摆脱了\"家猫\"的普通形象：它穿着一身银白色的宇航服，宇航服的胸前还有一个小小的红色圆形徽章，像是任务标识，头盔是透明的，能清晰看到小猫粉粉的鼻子、亮晶晶的圆眼睛，甚至能看到面罩上反射出的星星和地球的轮廓——就像我们戴眼镜时，镜片会反射周围的景物一样。小猫的四肢微微伸展，爪子轻轻握拳，像是在感受太空的失重感，又像是在向我们挥手打招呼。再看背景，黑色的太空里不只有单调的黑色，还有无数闪烁的星星：有的星星是小小的白色光点，有的带着淡蓝色或淡紫色的光晕，远处还有一缕淡淡的星云，像棉花糖一样轻轻飘着；而画面中央的蓝色地球，更是细节满满——能看到绿色的陆地、蓝色的海洋，还有白色的云层在地球表面流动，甚至能隐约看到某块大陆的海岸线，仿佛我们真的在太空中俯瞰地球。整个画面充满了科幻感和想象力，和上一个案例里\"随便趴在某处\"的普通猫比，简直像两个世界的作品！\n这就是细节和场景的\"魔力\"所在：\"穿着宇航服\"明确了小猫的\"特殊装备\"，\"可爱\"定义了小猫的\"气质\"，这些细节让小猫从\"一只普通猫\"变成了\"有专属形象的太空小猫\"；而\"漂浮在太空中\"\"背景是美丽的蓝色地球\"，则给小猫搭建了一个具体的\"舞台\"，让它不再是\"无依无靠的猫\"，而是\"有环境、有故事的角色\"。AI拿到这些信息后，会把\"太空猫\"和\"太空场景\"精准结合——它知道宇航服该是什么样子，太空的背景该有哪些元素，地球在太空中该呈现出怎样的视觉效果，然后把这些元素整合起来，创作出有画面感的作品。这就像我们跟同桌说\"画一只穿宇航服的小猫在太空看地球\"，同桌不仅知道要画猫和宇航服，还知道要画太空和地球，甚至能根据\"可爱\"的要求，给小猫画一个微笑的表情。这样一来，画面就不再是\"元素的堆砌\"，而是\"有故事的场景\"——我们能想象出小猫的\"太空冒险\"：它是不是第一次进入太空？是不是在寻找其他星球的朋友？是不是在想念地球家里的小窝？这种能引发联想的画面，就是细节和场景给提示词注入的\"魔法\"。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 9,
      "video_script": "增加风格描述：在上一句的基础上，分别加入\"宫崎骏动画风格\"、\"梵高油画风格\"、\"中国水墨画风格\"，展示风格的巨大变化。\n如果说细节和场景让画面\"有了故事\"，那风格描述就能让故事\"穿上不同的衣裳\"。我们在刚才\"太空小猫\"的提示词基础上，分别加入三种不同的风格，看看AI会给我们带来怎样的惊喜。这三个提示词分别是：\n1.\"一只穿着宇航服的可爱小猫，漂浮在太空中，背景是美丽的蓝色地球，宫崎骏动画风格\"\n2.\"一只穿着宇航服的可爱小猫，漂浮在太空中，背景是美丽的蓝色地球，梵高油画风格\"\n3.\"一只穿着宇航服的可爱小猫，漂浮在太空中，背景是美丽的蓝色地球，中国水墨画风格\"\n大家对比这三张图，是不是能明显感觉到——虽然画的都是\"太空小猫\"，但看起来完全是三幅不同的艺术作品！\n先看第一张\"宫崎骏动画风格\"的图：它完美还原了宫崎骏作品的\"治愈感\"——小猫的线条圆润柔和，没有任何尖锐的棱角，耳朵是圆圆的，爪子是小小的，连宇航服的边缘都用了淡淡的黄色线条勾勒，显得特别可爱；小猫的表情特别温柔，嘴角微微上扬，像在微笑，仿佛下一秒就要发出软软的\"喵\"声。背景里的太空不是纯黑的，而是带着淡淡的浅灰色，星星不是点状的，而是像小灯笼一样带着朦胧的白色光晕；地球的颜色像水彩一样柔和，蓝色的海洋、绿色的陆地之间没有生硬的分界线，白色的云层像棉花糖一样轻轻盖在地球表面，甚至能看到几缕云丝飘向太空。整个画面没有强烈的色彩对比，却让人感觉特别温暖，就像《龙猫》里的龙猫巴士、《天空之城》里的漂浮城堡一样，能瞬间治愈人心——这就是宫崎骏风格的\"密码\"：柔和的线条、明亮的色彩、治愈的氛围。\n再看第二张\"梵高油画风格\"的图，风格瞬间变得强烈起来：画面充满了梵高标志性的\"扭曲笔触\"和\"色彩冲击\"——小猫的宇航服不再是光滑的银白色，而是用了大量扭曲的波浪状笔触，颜色里还夹杂着黄色、橙色的色块，像被阳光照亮的金属；小猫的轮廓也不是清晰的，而是用粗重的橙色线条勾勒，显得很有力量。太空的背景更是充满动感：黑色的太空里，蓝色和紫色的色块交织旋转，像漩涡一样，星星不是小光点，而是巨大的黄色光斑，有的还拖着长长的橙色尾巴，像流星在燃烧；地球的颜色浓郁厚重，绿色的陆地用了深绿和浅绿的对比，蓝色的海洋里夹杂着一点紫色，边缘还有明显的橙色线条，仿佛地球在发光。整个画面像有生命一样在\"动\"，我们能感受到宇宙的浩瀚和热烈，就像梵高的《星月夜》里旋转的星空、《向日葵》里饱满的色彩一样，充满了强烈的情感张力——这就是梵高风格的\"密码\"：扭曲的笔触、浓烈的色彩、动感的氛围。\n最后看第三张\"中国水墨画风格\"的图，画风瞬间变得淡雅空灵：画面没有用鲜艳的颜色，只有墨色的浓淡和一点点淡淡的蓝色——小猫的轮廓用浓墨勾勒，线条简洁流畅，没有多余的细节；宇航服的部分用淡墨晕染，通过墨色的深浅来表现宇航服的立体感，显得很含蓄。太空的背景没有画满，而是留了大量的白色空白，只在角落用淡墨轻轻扫了几笔，表现星星的朦胧感；地球用淡淡的蓝色晕染，边缘模糊，像在宣纸上慢慢散开的颜色，没有勾勒清晰的轮廓，却能让人一眼认出是地球。整个画面遵循了中国水墨画\"留白见意境\"的特点，没有多余的元素，却让人感觉很空灵，仿佛能听到太空的寂静，感受到小猫的孤独与优雅——这就是中国水墨画的\"密码\"：简洁的线条、墨色的晕染、留白的意境。\n这三种风格的变化，其实是AI\"解读风格密码\"的过程：AI通过学习成千上万幅宫崎骏的动画原画、梵高的油画原作、中国水墨画大师的作品，记住了每种风格的\"核心特征\"——线条、色彩、笔触、氛围。当我们在提示词里加入风格描述时，就是告诉AI\"用这种风格的密码来创作\"，AI就能精准地把\"太空小猫\"的主题和风格特征结合起来，让同一个主题呈现出完全不同的艺术效果。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 10,
      "video_script": "通过这三页的案例对比，我们就像亲手拆解了提示词的\"魔法\"：从\"一只猫\"的普通画面，到\"穿宇航服的猫在太空\"的生动场景，再到三种风格的艺术作品，我们能清晰地发现一个规律——提示词越丰富、越具体，AI的创作就越惊艳、越贴近我们的想象。\n我们再来回顾一下这个\"魔法升级\"的过程：\n简单的提示词，比如\"一只猫\"，只能生成普通、缺乏特色的画面。就像我们写作文只写\"有一个人\"，没有说他是谁、长什么样、在做什么，读者只能想象出一个模糊的\"人影\"，没有记忆点；AI生成的画面也一样，只有\"猫\"的骨架，没有\"细节、场景、风格\"的血肉，看完就忘。\n增加细节和场景后，比如\"穿宇航服的可爱小猫在太空看地球\"，画面瞬间变得生动有趣。这就像给作文里的\"人\"加上了\"扎着马尾辫、背着红色书包、在公园里喂鸽子\"的描述，读者能立刻想象出具体的形象和场景，甚至能联想到\"她喂鸽子时是不是很开心\"的故事；AI的画面也有了\"情节\"，我们能从画面里看到小猫的\"太空冒险\"，感受到画面背后的故事感。\n再加入风格描述，比如\"宫崎骏风格\"\"梵高风格\"，画面就有了独特的艺术气质。这就像给作文加上\"用温暖的语气写\"\"用充满激情的语气写\"，同样的故事，不同的语气能带来不同的感受；AI的画面也一样，同样的\"太空小猫\"，不同的风格能呈现出治愈、热烈、淡雅等完全不同的氛围，让作品有了\"艺术感\"。\n这背后的秘密其实很简单：AI就像一个\"超级会画画但记性不好的朋友\"——它会画的东西很多，能模仿的风格也很多，但它不知道你心里具体喜欢什么。你跟它描述得越详细，它就越能\"精准踩中\"你的喜好；你跟它说的要求越具体，它就越能\"按你的想法创作\"。提示词里的每一个细节（比如\"可爱\"\"宇航服上有徽章\"）、每一个场景（比如\"漂浮在太空\"\"背景有地球\"）、每一种风格（比如\"宫崎骏\"\"水墨画\"），都不是\"多余的话\"，而是在给AI\"划重点\"，告诉它\"我想要这样的效果\"，让它的创作不偏离你的期待。\n在以后使用AI小画家时，大家可以记住这个\"提示词魔法口诀\"：主体要明确，细节要丰富，场景要具体，风格要鲜明。我们来举个例子练习一下：如果想画一只兔子，不要只说\"画一只兔子\"，可以把口诀用进去，变成\"一只长着垂耳朵的白色兔子，嘴里叼着半根胡萝卜，坐在红色屋顶的蘑菇屋里，蘑菇屋周围有发光的萤火虫和紫色的小野花，迪士尼动画风格\"。大家看，这样的提示词里，\"白色兔子\"是明确的主体，\"垂耳朵、叼胡萝卜\"是丰富的细节，\"红色屋顶蘑菇屋、萤火虫、小野花\"是具体的场景，\"迪士尼动画风格\"是鲜明的风格——AI拿到这样的提示词，画出来的兔子肯定比\"一只兔子\"要惊艳得多。\n其实，你们每个人的脑海里都藏着无数奇思妙想：可能是会飞的鲸鱼，可能是住在月亮上的小精灵，可能是能穿越时空的火车……而提示词，就是把这些奇思妙想\"告诉\"AI的桥梁。以后大家用AI画画时，不要怕麻烦，把你想到的细节哪怕是\"小精灵的帽子上有个小铃铛\"\"火车的窗户是圆形的\"都写进提示词里。相信只要用好这个\"魔法口诀\"，你们一定能让AI小画家把你心里的世界，变成一张张生动又独特的画面！"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 11,
      "video_script": "同学们，通过上一节的学习，我们知道给提示词加入风格描述后，AI 能画出千变万化的作品。AI 就像一位多才多艺的画家，既能画可爱的卡通，又能画逼真的照片，还能模仿艺术大师的风格，甚至能创造充满未来感的科幻世界。这一节我们就一起来欣赏几种经典的 AI 绘画风格，感受不同风格的独特魅力，大家在欣赏时可以试着想：如果让你用这种风格画自己的教室，会加入哪些细节呢？\n首先我们来欣赏卡通动漫风的 AI 绘画作品。大家看这张画，画面里有一个穿着日式校服的少女，扎着蓬松的双马尾，发尾还别着小小的樱花发饰；她的眼睛又大又亮，像两颗裹着水光的蓝宝石，眼尾微微上翘，眼睫毛画得纤长又整齐，脸颊上还有淡淡的红晕，像刚跑完步一样透着元气。她站在满开的樱花树下，右手轻轻接住一片飘落的花瓣，粉色的樱花花瓣在空中形成轻盈的弧线，有的落在她的肩膀上，有的飘向地面 —— 地面上已经铺了一层薄薄的 \"樱花毯\"，甚至能看到几只小蚂蚁在花瓣间爬行。背景是澄澈的蓝天白云，偶尔有几只鸽子掠过，整个画面色彩非常鲜艳：樱花的粉是柔和的浅粉，不会让人觉得刺眼；天空的蓝是透亮的淡蓝，像刚洗过一样；校服的白是干净的米白，搭配红色的领结和袖口，既明快又和谐，连校服裙摆的褶皱都画得清晰可见。\n卡通动漫风最明显的特点就是线条简洁明快，人物的轮廓用粗细均匀的黑色线条勾勒出来，没有多余的杂线，比如少女的刘海边缘、校服的领口线条，都干净利落；色彩饱和亮丽，很少用灰暗的颜色，即使是阴影部分，也会用浅灰色或同色系的淡色来表现，看起来充满活力；人物形象可爱夸张，眼睛通常画得很大 —— 几乎占了脸部的三分之一，表情也很丰富，比如开心时眼睛弯成月牙，嘴角还会出现小小的梨涡，惊讶时眼睛瞪得圆圆的，眉毛挑得高高的，甚至会用汗珠、红晕这些小符号强化情绪。这种风格的作品充满了童趣和活力，就像我们喜欢看的日本动漫《火影忍者》里鸣人充满干劲的表情、《海贼王》里路飞咧嘴大笑的模样，还有国产动漫《罗小黑战记》里圆滚滚的小黑猫，都带着这种风格的影子，让人看了忍不住嘴角上扬，心情愉悦。\nAI 画卡通动漫风时，能精准把握这种风格的精髓，甚至比我们手动画得更细腻。它会把人物的比例画得更符合 \"Q 萌感\"，比如头身比是 1:3，看起来头大大的、身子小小的，像可爱的玩偶；会用渐变的色彩让画面更有层次感，比如少女的头发从头顶的深棕色，慢慢渐变到发尾的浅棕色，还会在发顶加一点白色的高光，模拟阳光照射的效果；衣服上的花纹也不会马虎，比如校服的袖口有细细的白色条纹，领结上有小小的格子图案，连少女袜子上的蕾丝花边都清晰可见。背景里的小装饰也很用心，比如樱花树的树干上有淡淡的纹理，天空中的云朵边缘加了一点白色的晕染，让云朵看起来软软的。无论是可爱的小动物（比如戴着蝴蝶结的柯基、会飞的猫咪）、帅气的少年（比如穿着骑士服的王子、背着书包的学霸），还是梦幻的场景（比如长满棉花糖的森林、漂浮着城堡的天空），AI 都能画出充满动漫感的作品，甚至还能根据我们的要求，加入动漫里的经典元素，比如《龙猫》里的巴士、《千与千寻》里的小煤球，让画面更有亲切感。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 12,
      "video_script": "接下来我们欣赏写实照片风的 AI 绘画作品，这种风格的作品最让人惊叹的就是它的逼真程度 —— 如果不提前说这是 AI 画的，很多人都会以为是用相机拍出来的。大家先看这张风景照：金黄的麦田在阳光下像海浪一样波浪起伏，每一根麦芒都清晰可见，有的麦芒还沾着小小的露珠，在阳光下发着微光；远处有几棵高大的白杨树，树干的纹路粗糙又真实，树枝上的叶子有的是深绿色，有的已经泛黄，甚至能看到几片枯叶挂在枝头，随时会飘落；天空中飘着几朵蓬松的白云，云朵的边缘不是整齐的，而是像棉花一样毛茸茸的，阳光透过云层，在麦田上投下一块块不规则的光斑，光斑的颜色比周围的麦田更亮一点，像撒了一层碎金。再看这张人像作品：女孩的头发是浅棕色的卷发，每一根发丝都根根分明，甚至能看到发缝里细小的绒毛；皮肤的纹理自然又真实，额头有淡淡的绒毛，鼻子两侧有一点细小的毛孔，脸颊上还有几颗浅浅的小雀斑，完全不是 \"完美无瑕\" 的假脸；她的眼神温柔，瞳孔里有淡淡的反光，像是看到了喜欢的东西，嘴角带着浅浅的微笑，连嘴角的细纹都清晰可见，就像我们身边的同学站在面前一样，让人忍不住想和她打招呼。\n写实照片风的核心特点就是高度还原真实世界，无论是光影、色彩还是细节，都和我们用相机拍出来的照片几乎一模一样。比如光线的表现：如果是顺光拍摄，人物的正面会很亮，阴影在背后；如果是逆光拍摄，人物的轮廓会有一层金色的光晕，正面则会暗一点，AI 都能精准还原。色彩方面，它不会像卡通风那样用夸张的颜色，而是遵循真实世界的色彩规律，比如麦田的黄色会随着光线变化，靠近阳光的地方是亮黄色，背光的地方是深黄色；天空的蓝色在早上是淡蓝色，中午是深蓝色，傍晚则会加一点橙色的晚霞。细节上更是 \"吹毛求疵\"，比如布料的褶皱 —— 牛仔裤的膝盖处有自然的褶皱，褶皱的阴影颜色会比布料本身深一点；金属的反光 —— 钥匙扣上的金属部分会反射周围的环境色，比如旁边有红色的杯子，反光就会带一点红色；远处的景物会有 \"透视效果\"，比如远处的白杨树会比近处的小，轮廓也会模糊一点，就像我们用眼睛看远处的东西一样，不会那么清晰。\nAI 为了画好这种风格，背后付出了 \"海量学习\" 的努力 —— 它需要学习几百万甚至几千万张真实的照片数据，这些照片涵盖了不同的场景（风景、人像、美食、建筑）、不同的光线（晴天、阴天、夜晚）、不同的材质（皮肤、布料、金属、木头）。在学习过程中，AI 会分析这些照片的 \"视觉规律\"：比如阳光照射在皮肤上时，高光在额头、鼻尖这些凸起的地方，阴影在眼窝、下巴这些凹陷的地方；比如布料的褶皱会随着物体的形状变化，穿在人身上的衣服，褶皱会集中在肩膀、腰部这些活动多的地方；比如远处的景物因为空气的阻隔，会变得模糊，颜色也会偏淡。通过这些学习，AI 才能在画画时 \"举一反三\"，比如画一件白色的衬衫，它知道衬衫的领口会有自然的褶皱，袖口的纽扣会有金属反光，甚至能画出衬衫上因为清洗留下的淡淡的纹路。\n这种风格的作品常常让人真假难辨，甚至能 \"以假乱真\"。比如 AI 画的一碗牛肉面：面条是淡黄色的，每一根面条上都裹着淡淡的汤汁，看起来很有嚼劲；牛肉是深红色的，纹理清晰，边缘还有一点焦褐色，像是刚卤好的；汤汁是浓郁的棕色，表面漂浮着几点油花，还有几片绿色的香菜和红色的辣椒点缀，甚至能看到汤汁上方飘着淡淡的热气，看起来就像刚从厨房里端出来的一样，让人忍不住想流口水。再比如 AI 画的城市夜景：高楼大厦的玻璃幕墙会反射周围的灯光，有的反射路灯的黄色，有的反射霓虹灯的紫色；马路上的车流光轨是红色和黄色的，长而流畅，能看出汽车行驶的速度；路边的路灯会有淡淡的光晕，光晕的颜色从中心的亮黄色慢慢过渡到周围的浅黄色，和真实的夜景照片没什么区别。还有 AI 画的宠物照片，比如一只趴在沙发上的柯基：它的毛发是黄白相间的，黄色的部分在阳光下有点发亮，白色的部分在沙发的阴影里有点发灰；它的耳朵耷拉在脸颊两侧，耳尖有一点黑色的绒毛；爪子搭在沙发的扶手上，肉垫是粉红色的，甚至能看到肉垫上细小的纹路 —— 如果把这张画给不了解 AI 的人看，他们大概率会以为这是主人给自家柯基拍的生活照。写实照片风的 AI 作品告诉我们，AI 不仅能画我们想象中的、现实里没有的画面，还能精准还原真实世界的细节，成为我们 \"记录生活\" 的小帮手。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 13,
      "video_script": "AI最神奇的本领之一，就是能模仿著名艺术大师的风格作画，让我们能看到\"如果大师画这个主题会是什么样子\"。我们先看模仿达芬奇风格的作品：画面是一位抱着小猫的少女，线条细腻柔和，色彩偏暗，有种古典油画的质感，光线从侧面照射过来，人物的脸上有明显的明暗对比，就像达芬奇的《蒙娜丽莎》一样充满神秘感。\n再看模仿毕加索风格的作品：同样是画人物，但画面里的人物五官是错位的，眼睛一只在左边，一只在头顶，身体由各种几何图形组成，色彩鲜艳大胆，红、蓝、黄三种颜色对比强烈，线条粗犷，充满了抽象的艺术感，就像毕加索的《格尔尼卡》一样打破了传统的绘画规则。\nAI能模仿艺术大师风格，是因为它学习了大量大师的原作。它会分析大师的笔触特点（比如达芬奇细腻的线条、梵高奔放的笔触）、色彩偏好（比如莫奈喜欢用明亮的色彩画风景、伦勃朗喜欢用暗色调）、构图习惯（比如达芬奇喜欢用三角形构图、毕加索喜欢用几何图形）。当我们在提示词里加入\"模仿达芬奇风格\"时，AI就会把这些学到的特点运用到新的作品中，创作出既有大师风格又有新主题的作品。这种风格的作品让我们感受到了艺术的传承和创新，也让我们更了解不同大师的艺术特色。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 14,
      "video_script": "AI 最神奇的本领之一，就是能模仿著名艺术大师的风格作画 —— 就像让大师 \"复活\"，为我们画新的主题一样，让我们能看到 \"如果大师画这个主题会是什么样子\"，这也是 AI 绘画最有艺术感的地方。我们先看模仿达芬奇风格的作品：画面是一位抱着小猫的少女，少女穿着文艺复兴时期的长裙，裙摆上有细腻的花纹，领口和袖口有蕾丝装饰；她的姿势很优雅，左手轻轻抱着小猫，右手放在小猫的头上，眼神温柔地看着小猫，就像《蒙娜丽莎》的眼神一样，带着一丝神秘。这幅画的线条细腻柔和，没有明显的笔触痕迹，色彩偏暗，主要用棕色、米色、深绿色这些古典的颜色，有种古典油画的质感；光线从画面的左侧照射过来，少女的左脸亮，右脸暗，人物的脸上有明显的明暗对比（这种手法叫 \" chiaroscuro\"，是达芬奇常用的光影技巧），连小猫的毛发都有明暗变化，看起来立体又真实。整幅画没有鲜艳的颜色，却透着一种沉静的美感，就像达芬奇的《蒙娜丽莎》《抱银鼠的女子》一样，充满神秘感，让人忍不住想琢磨画面背后的故事。\n再看模仿毕加索风格的作品：同样是画人物，但和达芬奇的风格完全是两个极端。画面里的人物是一位弹吉他的少年，但他的五官是错位的 —— 眼睛一只在左边脸颊的中间，一只在头顶的位置，而且眼睛的形状是三角形的；鼻子是倒过来的，嘴巴是一条弯曲的弧线，像在微笑又像在难过；身体由各种几何图形组成，肩膀是梯形的，手臂是长方形的，吉他是圆形和三角形的组合。色彩方面非常鲜艳大胆，红、蓝、黄三种颜色对比强烈，少年的衣服是红色的，吉他是蓝色的，背景是黄色的，没有过渡色，直接用色块拼接；线条粗犷有力，用黑色的粗线勾勒轮廓，甚至有的线条会超出轮廓，看起来很随意但又充满张力。这幅画打破了传统绘画 \"比例正确、五官端正\" 的规则，充满了抽象的艺术感，就像毕加索的《格尔尼卡》《亚维农少女》一样，用夸张、变形的手法表达情感，虽然看起来 \"奇怪\"，但能让人感受到强烈的艺术冲击力。\n除了达芬奇和毕加索，AI 还能模仿很多艺术大师的风格，比如莫奈的印象派。大家看这幅 \"莫奈风格的睡莲池\"：画面里的睡莲不是清晰的，而是用淡淡的蓝色、紫色、粉色的色块晕染而成，看起来像水面上的倒影；水面上有阳光的光斑，用黄色和橙色的小色块表现，显得波光粼粼；岸边的芦苇是长长的绿色线条，模糊又灵动，就像莫奈的《睡莲》系列作品一样，注重光影的变化，而不是细节的清晰。再比如伦勃朗的风格，AI 画的 \"伦勃朗风格的书房\"：画面里有一张木质书桌，桌上放着一盏台灯，台灯的光线照亮了桌上的书和羽毛笔，而周围的环境很暗，只有一点微弱的光线从窗户透进来，形成 \"亮部集中、暗部深邃\" 的效果，就像伦勃朗的《夜巡》一样，用强烈的明暗对比突出画面的焦点，充满古典的厚重感。\nAI 能模仿艺术大师风格，背后的 \"秘密\" 就是 \"海量学习 + 特征提取\"。它会学习几千甚至几万幅大师的原作，比如模仿达芬奇时，会分析他的每一幅画：线条是细腻还是粗犷？常用的颜色有哪些？光影是怎么分布的？构图喜欢用什么形状（比如达芬奇喜欢用三角形构图，让画面更稳定）。在学习过程中，AI 会提取出这些 \"风格特征\"—— 比如达芬奇的 \"细腻线条 + 暗色调 + 三角构图\"，毕加索的 \"几何变形 + 强烈色彩对比 + 粗线条\"，莫奈的 \"色块晕染 + 光影变化 + 模糊轮廓\"。当我们在提示词里加入 \"模仿 XX 大师风格\" 时，AI 就会把这些学到的特征 \"套用\" 到新的主题中，比如把 \"达芬奇的光影技巧\" 用到 \"抱着小猫的少女\" 上，把 \"毕加索的几何变形\" 用到 \"弹吉他的少年\" 上，创作出既有大师风格又有新主题的作品。这种风格的作品不仅让我们感受到了艺术的传承 —— 即使大师已经不在了，他们的艺术风格还能通过 AI 延续，还让我们更了解不同大师的艺术特色，比如通过 AI 画的 \"莫奈风格的校园\"，我们能更直观地理解 \"印象派不追求细节，只追求光影和色彩感觉\" 的特点，比单纯看课本上的文字描述更生动。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 15,
      "video_script": "同学们，提示词像你和AI小画家\"对话的语言\"，直接决定AI能不能画出你脑海里的画面：\n首先，提示词是\"打开创意大门的钥匙\"。想象AI是个等待指令的小画家，但它\"听不懂模糊的话\"——如果你只说\"画赛博朋克风的蓝发少女\"，AI可能画得很普通；但如果说\"赛博朋克风格，蓝发少女穿荧光战衣，在霓虹交错的未来都市屋顶奔跑，发丝缠绕电流特效\"，AI就能精准捕捉细节，把你想象的炫酷场景\"搬\"到画布上。越精准的提示词，越能让AI成为你的\"创意助手\"，就像用对了钥匙，一下打开创作的大门！\n其次，模糊提示词等于\"无效指令\"。比如只说\"画一只猫\"，AI会画得平平无奇——因为你没说清\"什么样的猫（是柴郡猫还是机械猫？）、在哪（是樱花树下还是太空舱？）、啥风格（是水墨风还是科幻风？）\"。缺少这些细节，AI只能交出最普通的答卷，和你脑海里的创意完全\"对不上号\"。\n最后，学写提示词是AI绘画的\"第一步\"！这就像学画画时，你得先练轮廓、学构图——提示词也有自己的\"结构逻辑\"：主体（画什么）+风格（怎么画）+场景（在哪画）+细节（加什么特效）。掌握这个思路，你就能指挥AI画出更独特的作品：从\"画普通猫\"升级为\"画《爱丽丝梦游仙境》里的柴郡猫，水彩风格，在下午茶场景中笑着飘起来\"。把提示词练熟，就是在给AI绘画\"打基础\"。"
    },
    {
      "chapter": 4,
      "section": 1,
      "main_title": "AI 小画家（上）—— 指令的艺术",
      "slide_number": 16,
      "video_script": "下一节课，我们就来亲手尝试写提示词，让AI画出我们喜欢的风格作品，体验创作的乐趣！你会发现：只要掌握提示词的\"说话逻辑\"，AI就像你的专属小画家，能把脑海里的奇幻世界\"一键变现\"。从今天\"懂原理\"，到下节课\"动手玩\"，咱们一步步解锁\"让想象成真\"的乐趣——是不是已经迫不及待了？下节课，咱们敲着键盘写提示词，见证AI把文字变成艺术！"
    }
  ]
}
